#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

  ~ resource "keycloak_openid_client" "CLIENT" {
        id                                         = "9d7291bb-590e-4f08-bf7d-e83626bf2b89"
      + name                                       = "PIDP-SERVICE-ACCOUNT"
        # (26 unchanged attributes hidden)
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.PIDP-SERVICE-ACCOUNT.keycloak_openid_audience_protocol_mapper.PIDP-SERVICE-aud-mapper will be created
  + resource "keycloak_openid_audience_protocol_mapper" "PIDP-SERVICE-aud-mapper" {
      + add_to_access_token      = true
      + add_to_id_token          = false
      + client_id                = (known after apply)
      + id                       = (known after apply)
      + included_client_audience = "PIDP-SERVICE"
      + name                     = "PIDP-SERVICE aud mapper"
      + realm_id                 = "moh_applications"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.PIDP-SERVICE-ACCOUNT.keycloak_openid_client.CLIENT will be created
  + resource "keycloak_openid_client" "CLIENT" {
      + access_token_lifespan                     = "300"
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "PIDP-SERVICE-ACCOUNT"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + description                               = "Service account for Provider Identity Portal. Authorizes internal maintenance endpoint calls"
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = false
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "PIDP-SERVICE-ACCOUNT"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "moh_applications"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.PIDP-SERVICE-ACCOUNT.keycloak_openid_user_client_role_protocol_mapper.client_role_mapper will be created
  + resource "keycloak_openid_user_client_role_protocol_mapper" "client_role_mapper" {
      + add_to_access_token         = true
      + add_to_id_token             = true
      + add_to_userinfo             = true
      + claim_name                  = "resource_access.PIDP-SERVICE.roles"
      + claim_value_type            = "String"
      + client_id                   = (known after apply)
      + client_id_for_role_mappings = "PIDP-SERVICE-ACCOUNT"
      + id                          = (known after apply)
      + multivalued                 = true
      + name                        = "client roles"
      + realm_id                    = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PIDP-SERVICE-ACCOUNT.keycloak_openid_client.CLIENT will be updated in-place
  ~ resource "keycloak_openid_client" "CLIENT" {
        id                                         = "b6c1bde3-74c1-4ede-877d-77b0647f54a1"
      + name                                       = "PIDP-SERVICE-ACCOUNT"
        # (26 unchanged attributes hidden)
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.PIDP-SERVICE-ACCOUNT.module.client-roles.keycloak_role.ROLES["service_account"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "service_account"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.PIDP-SERVICE-ACCOUNT.module.service-account-roles.keycloak_openid_client_service_account_realm_role.ROLE["default-roles-moh_applications"] will be created
  + resource "keycloak_openid_client_service_account_realm_role" "ROLE" {
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "default-roles-moh_applications"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.PIDP-SERVICE-ACCOUNT.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PIDP-SERVICE-ACCOUNT/service_account"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = (known after apply)
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "service_account"
      + service_account_user_id = (known after apply)
    }

Plan: 6 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @filipflorek, Action: `pull_request`*